app/controllers/posts_controller.rb

SELECT  "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
INSERT INTO "posts" ("description", "user_id", "created_at", "updated_at", "image") VALUES (?, ?, ?, ?, ?)  [["description", "postconimagen"], ["user_id", 1], ["created_at", "2018-05-05 11:13:13.346088"], ["updated_at", "2018-05-05 11:13:13.346088"], ["image", "descarga.jpg"]]
---
  def create
    @user = User.find(create_params[:user_id])
    @post = @user.posts.new(create_params)
    if @post.save