app/controllers/users_controller.rb

INSERT INTO "users" ("name", "email", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["name", "mewUser"], ["email", "mewuser@email.es"], ["created_at", "2018-05-03 19:25:16.607221"], ["updated_at", "2018-05-03 19:25:16.607221"]]
---
  def create
    @user = User.new(create_params)
    if @user.save