app/models/post.rb


  representation :basic do
    {
      description: description,
      author: User.find(user_id).name,
      created_at: created_at
---
SELECT  "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]